# 4.5 Data Consistency Checks.ipynb — TOC
	1.	Setup (imports + paths)
	2.	Lesson: Data consistency checks
        2.1 Mixed-type data
        2.2 Missing values
        2.3 Duplicates
        2.4 Finding duplicates
        2.5 Addressing duplicates
	3.	Exercise checks (df_ords)
        3.1 Summary stats (describe)
        3.2 Mixed-type check
        3.3 Missing values check
        3.4 Duplicate check + resolution
	4.	Outputs saved / notes

# Importing

In [113]:
# Import libraries
import pandas as pd
import numpy as np
import os

The history saving thread hit an unexpected error (OperationalError('attempt to write a readonly database')).History will not be written to the database.

In [114]:
# Import datasets
path = r'/Users/spencer/Documents/Career Foundry/Data Immersion/4 Python Fundamentals for Data Analysts/Instacart Basket Analysis'
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'), index_col = False)
df_dep = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'departments_wrangled.csv'), index_col = False)

# (Lesson) Data Consistency Checks

## Mixed-Type Data

In [115]:
# Create a dataframe

df_test = pd.DataFrame()

In [116]:
# Create a mixed type column

df_test['mix'] = ['a', 'b', 1, True]

In [117]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [118]:
for col in df_test.columns.tolist():
  weird = (df_test[[col]].map(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [119]:
df_test['mix'] = df_test['mix'].astype('str')

## Missing Values

In [120]:
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [121]:
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [122]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [123]:
df_prods.shape

(49693, 5)

In [124]:
# Make new dataframe, removing null 'product_name' values
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [125]:
df_prods_clean.shape

(49677, 5)

## Duplicates

### Finding Duplicates

In [126]:
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [127]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

### Addressing Duplicates

In [128]:
df_prods_clean.shape

(49677, 5)

In [129]:
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [130]:
df_prods_clean_no_dups.shape

(49672, 5)

# Exercise

## 2. Run the df.describe() function on your df_ords dataframe. Using your new knowledge about how to interpret the output of this function, share in a markdown cell whether anything about the data looks off or should be investigated further. Tip: Keep an eye on min and max values!

In [131]:
df_ords.describe()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [132]:
# Sanity check to make sure it wasnt a trick question?
df_ords.head(10)

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0
5,3367565,1,6,2,7,19.0
6,550135,1,7,1,9,20.0
7,3108588,1,8,1,14,14.0
8,2295261,1,9,1,16,0.0
9,2550362,1,10,4,8,30.0

### I investigated the min/max values for order_dow (0-6) and order_hour_of_day (0-23) and found them to be within the expected logical ranges. No inconsistencies were found?

## 3. Check for mixed-type data in your df_ords dataframe.

In [133]:
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].map(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

### No mixed-type data

## 4. If you find mixed-type data, fix it. The column in question should contain observations of a single data type.

### No mixed type data

## 5. Run a check for missing values in your df_ords dataframe.

In [134]:
df_ords.isnull().sum()

order_id                       0
user_id                        0
order_number                   0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

### 206209 values were found with missing data in the 'days_since_prior_order' column. These likely correspond to customer's first orders. Since there are no prior orders to calculate, the values are null. Likely not an error.

## 6. Address the missing values using an appropriate method.

In [135]:
# Create a new column 'first_order' if 'days_since_prior_order' is null
df_ords['first_order'] = df_ords['days_since_prior_order'].isnull()

# Check work
df_ords.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_order
0,2539329,1,1,2,8,NaN,True
1,2398795,1,2,3,7,15.0,False
2,473747,1,3,3,12,21.0,False
3,2254736,1,4,4,7,29.0,False
4,431534,1,5,4,15,28.0,False

### Created a new column 'first_order'. It acts as a flag: True if 'days_since_prior_order' is NaN, False otherwise

## 7. Run a check for duplicate values in your df_ords data.

In [136]:
df_ords_dups = df_ords[df_ords.duplicated()]

In [137]:
df_ords_dups

Empty DataFrame
Columns: [order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_prior_order, first_order]
Index: []

### No duplicates

## 8. Address the duplicates using an appropriate method.

### No duplicates

## 9. Export your final, cleaned df_prods and df_ords data as “.csv” files in your “Prepared Data” folder and give them appropriate, succinct names.

In [138]:
df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data','Prepared Data', 'products_checked.csv'), index=False)

In [139]:
df_ords.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_checked.csv'), index=False)